---
kind: enumMember
id: F:Autodesk.Revit.DB.SolidGeometry.ACIS
enum: Autodesk.Revit.DB.SolidGeometry
source: html/5d324ccb-04a0-0044-dc7d-1e144163082d.htm
---
# Autodesk.Revit.DB.SolidGeometry.ACIS

All visible Revit Building geometry is exported as ACIS 3D solids
 (except for any elements that are already a polymesh.)